<template>
  <div class="page-wrapper">
    <Table :products="products" />
  </div>
</template>

<script>
import Table from "@/components/Table";
export default {
  data() {
    return {
      products: [
        { type: "Компьютер", name: "Dell XPS 13", price: "90000" },
        { type: "Компьютер", name: "Dell XPS 13 ", price: "90000" },
        { type: "Компьютер", name: "Dell XPS 13", price: "90000" },
        { type: "Компьютер", name: "Dell XPS 13", price: "90000" },
        {
          type: "Компьютер",
          name:
            "Dell XPS 13Flexbox был добавлен в стандарты CSS несколько лет назад, в основном для того, чтобы разобраться с распределением места и выравниванием элементов. По сути, это синтаксис одномерной раскладкиА в купе с более новым CSS Grid, веб-разработчики получают куда более мощный инструмент для разработки сложных шаблонов, которые в последствии будет куда проще поддерживать и y. Как, вы можете смело и уверенно использовать Flexbox в вашем CSS.",
          price: "90000",
        },
        {
          type: "Компьютер",
          name:
            "Dell XPS 13Flexbox был добавлен в стандарты CSS несколько лет назад, в основном для того, чтобы разобраться с распределением места и выравниванием элементов. По сути, это синтаксис одномерной раскладкиА в купе с более новым CSS Grid, веб-разработчики получают куда более мощный инструмент для разработки сложных шаблонов, которые в последствии будет куда проще поддерживать и y. Как, вы можете смело и уверенно использовать Flexbox в вашем CSS.",
          price: "90000",
        },
        {
          type: "Компьютер",
          name:
            "Dell XPS 13Flexbox был добавлен в стандарты CSS несколько лет назад, в основном для того, чтобы разобраться с распределением места и выравниванием элементов. По сути, это синтаксис одномерной раскладкиА в купе с более новым CSS Grid, веб-разработчики получают куда более мощный инструмент для разработки сложных шаблонов, которые в последствии будет куда проще поддерживать и y. Как, вы можете смело и уверенно использовать Flexbox в вашем CSS.",
          price: "90000",
        },
        {
          type: "Компьютер",
          name:
            "Dell XPS 13Flexbox был добавлен в стандарты CSS несколько лет назад, в основном для того, чтобы разобраться с распределением места и выравниванием элементов. По сути, это синтаксис одномерной раскладкиА в купе с более новым CSS Grid, веб-разработчики получают куда более мощный инструмент для разработки сложных шаблонов, которые в последствии будет куда проще поддерживать и y. Как, вы можете смело и уверенно использовать Flexbox в вашем CSS.",
          price: "90000",
        },
      ],
    };
  },
  components: {
    Table,
  },
};
</script>

<style lang="scss" scoped>
</style>